#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.flyte_gcs_backend.random_id.bucket_suffix: Refreshing state... [id=FsY]
module.gcs_api_extract.random_id.bucket_suffix: Refreshing state... [id=i_k]
data.google_client_config.default: Reading...
google_project_service.composer_api: Refreshing state... [id=exemplary-tide-379122/composer.googleapis.com]
google_project_service.compute_api: Refreshing state... [id=exemplary-tide-379122/compute.googleapis.com]
module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"]: Refreshing state... [id=pricing-aggregator-us-east1-flyte-storage-backend]
module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"]: Refreshing state... [id=b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin]
google_project_service.container_api: Refreshing state... [id=exemplary-tide-379122/container.googleapis.com]
google_project_service.cloud_sql_api: Refreshing state... [id=exemplary-tide-379122/sqladmin.googleapis.com]
google_project_service.secret_mgr_api: Refreshing state... [id=exemplary-tide-379122/secretmanager.googleapis.com]
google_service_account.airflow_user_sa: Refreshing state... [id=projects/exemplary-tide-379122/serviceAccounts/airflow-user-sa@exemplary-tide-379122.iam.gserviceaccount.com]
module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"]: Refreshing state... [id=pricing-aggregator-us-east1-spotify-web-api-extracts]
data.google_client_config.default: Read complete after 0s [id=projects/"exemplary-tide-379122"/regions/"us-east1"/zones/<null>]
module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"]: Refreshing state... [id=b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin]
google_project_iam_binding.gsm_access: Refreshing state... [id=exemplary-tide-379122/roles/secretmanager.secretAccessor]
google_project_iam_binding.bq_access: Refreshing state... [id=exemplary-tide-379122/roles/bigquery.dataEditor]
google_project_iam_binding.gcs_access: Refreshing state... [id=exemplary-tide-379122/roles/storage.objectAdmin]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.flyte_gcs_backend.google_storage_bucket.buckets["flyte-storage-backend"] will be destroyed
  # (because google_storage_bucket.buckets is not in configuration)
  - resource "google_storage_bucket" "buckets" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "pricing-aggregator-us-east1-flyte-storage-backend" -> null
      - labels                      = {
          - "name"              = "pricing-aggregator-us-east1-flyte-storage-backend"
          - "project_name"      = "pricing-aggregator"
          - "project_workspace" = (sensitive value)
        } -> null
      - location                    = "US-EAST1" -> null
      - name                        = "pricing-aggregator-us-east1-flyte-storage-backend" -> null
      - project                     = (sensitive value) -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/pricing-aggregator-us-east1-flyte-storage-backend" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://pricing-aggregator-us-east1-flyte-storage-backend" -> null

      - versioning {
          - enabled = false -> null
        }
    }

  # module.flyte_gcs_backend.google_storage_bucket_iam_binding.admins["flyte-storage-backend"] will be destroyed
  # (because google_storage_bucket_iam_binding.admins is not in configuration)
  - resource "google_storage_bucket_iam_binding" "admins" {
      - bucket  = "b/pricing-aggregator-us-east1-flyte-storage-backend" -> null
      - id      = "b/pricing-aggregator-us-east1-flyte-storage-backend/roles/storage.objectAdmin" -> null
      - members = [] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

  # module.flyte_gcs_backend.random_id.bucket_suffix will be destroyed
  # (because random_id.bucket_suffix is not in configuration)
  - resource "random_id" "bucket_suffix" {
      - b64_std     = "FsY=" -> null
      - b64_url     = "FsY" -> null
      - byte_length = 2 -> null
      - dec         = "5830" -> null
      - hex         = "16c6" -> null
      - id          = "FsY" -> null
    }

  # module.gcs_api_extract.google_storage_bucket.buckets["rawg-api-extracts"] will be created
  + resource "google_storage_bucket" "buckets" {
      + default_event_based_hold    = false
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "name"              = "pricing-aggregator-us-east1-rawg-api-extracts"
          + "project_name"      = "pricing-aggregator"
          + "project_workspace" = (sensitive value)
        }
      + location                    = "US-EAST1"
      + name                        = "pricing-aggregator-us-east1-rawg-api-extracts"
      + project                     = (sensitive value)
      + public_access_prevention    = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + versioning {
          + enabled = false
        }
    }

  # module.gcs_api_extract.google_storage_bucket.buckets["spotify-web-api-extracts"] will be destroyed
  # (because key ["spotify-web-api-extracts"] is not in for_each map)
  - resource "google_storage_bucket" "buckets" {
      - default_event_based_hold    = false -> null
      - force_destroy               = false -> null
      - id                          = "pricing-aggregator-us-east1-spotify-web-api-extracts" -> null
      - labels                      = {
          - "name"              = "pricing-aggregator-us-east1-spotify-web-api-extracts"
          - "project_name"      = "pricing-aggregator"
          - "project_workspace" = (sensitive value)
        } -> null
      - location                    = "US-EAST1" -> null
      - name                        = "pricing-aggregator-us-east1-spotify-web-api-extracts" -> null
      - project                     = (sensitive value) -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/pricing-aggregator-us-east1-spotify-web-api-extracts" -> null
      - storage_class               = "STANDARD" -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://pricing-aggregator-us-east1-spotify-web-api-extracts" -> null

      - versioning {
          - enabled = false -> null
        }
    }

  # module.gcs_api_extract.google_storage_bucket_iam_binding.admins["rawg-api-extracts"] will be created
  + resource "google_storage_bucket_iam_binding" "admins" {
      + bucket = "pricing-aggregator-us-east1-rawg-api-extracts"
      + etag   = (known after apply)
      + id     = (known after apply)
      + role   = "roles/storage.objectAdmin"
    }

  # module.gcs_api_extract.google_storage_bucket_iam_binding.admins["spotify-web-api-extracts"] will be destroyed
  # (because key ["spotify-web-api-extracts"] is not in for_each map)
  - resource "google_storage_bucket_iam_binding" "admins" {
      - bucket  = "b/pricing-aggregator-us-east1-spotify-web-api-extracts" -> null
      - id      = "b/pricing-aggregator-us-east1-spotify-web-api-extracts/roles/storage.objectAdmin" -> null
      - members = [] -> null
      - role    = "roles/storage.objectAdmin" -> null
    }

Plan: 2 to add, 0 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kevinsunny1996, Action: `pull_request`*